## Setting up the environment

In [1]:
%%capture 
%load_ext sql 
%sql sqlite:///factbook.db

## Reading the Data

In [2]:
%%sql 

SELECT * 
  FROM facts
  LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

## Exploring the Data

In [4]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
  FROM facts;

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

In [5]:
%%sql 
SELECT name 
  FROM facts
 WHERE population =(SELECT MIN(population)
                      FROM facts);

 * sqlite:///factbook.db
Done.

[('Antarctica',)]

In [7]:
%%sql 
SELECT name 
  FROM facts 
 WHERE population = (SELECT MAX(population)
                       FROM facts);

 * sqlite:///factbook.db
Done.

[('World',)]

SINCE world and antartica is showing the population too broadly and showing inhabitant island then it needs to be excluded to know the minimum and maximum population

In [40]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
  FROM facts
 WHERE (name <> (SELECT name FROM facts WHERE population = (SELECT MIN(population)FROM facts))) and (name <> (SELECT name FROM facts WHERE population = (SELECT MAX(population)FROM facts)));

 * sqlite:///factbook.db
Done.

[(48, 1367485388, 0.0, 4.02)]

### Which country that has lower than average area while having more than average population?

In [9]:
%%sql 
SELECT AVG(population), AVG(area)
  FROM facts;

 * sqlite:///factbook.db
Done.

[(62094928.32231405, 555093.546184739)]

In [10]:
%%sql
SELECT name 
  FROM facts 
    WHERE (population > (SELECT AVG(population)
                          FROM facts)) and (area < (SELECT AVG(area)
                                                    FROM facts));

 * sqlite:///factbook.db
Done.

[('Bangladesh',),
 ('Germany',),
 ('Japan',),
 ('Philippines',),
 ('Thailand',),
 ('United Kingdom',),
 ('Vietnam',)]

### Which country that has the most people and which country has the highest growth rate?

In [39]:
%%sql 
SELECT name 
  FROM facts 
    WHERE (population = (SELECT MAX(population) FROM facts WHERE name <> "World"));

 * sqlite:///factbook.db
Done.

[('China',)]

In [29]:
%%sql
SELECT name 
  FROM facts 
    WHERE population_growth = (SELECT MAX(population_growth) FROM facts);

 * sqlite:///factbook.db
Done.

[('South Sudan',)]

### Which countries have the highest ratios of water to land? Which countries have more water than land?

In [38]:
%%sql 
SELECT name  
  FROM facts 
    WHERE area_water/area_land =(SELECT MAX(area_water/area_land) FROM facts);

 * sqlite:///factbook.db
Done.

[('British Indian Ocean Territory',)]

In [37]:
%%sql
SELECT name 
  FROM facts 
    WHERE area_water > area_land;

 * sqlite:///factbook.db
Done.

[('British Indian Ocean Territory',), ('Virgin Islands',)]

### Which countries will add the most people to their populations next year?

In [35]:
%%sql 
SELECT name 
  FROM facts 
    WHERE birth_rate = (SELECT MAX(birth_rate) FROM facts);

 * sqlite:///factbook.db
Done.

[('Niger',)]

### Which countries have a higher death rate than birth rate?

In [36]:
%%sql 
SELECT name 
  FROM facts 
    WHERE death_rate > birth_rate;

 * sqlite:///factbook.db
Done.

[('Austria',),
 ('Belarus',),
 ('Bosnia and Herzegovina',),
 ('Bulgaria',),
 ('Croatia',),
 ('Czech Republic',),
 ('Estonia',),
 ('Germany',),
 ('Greece',),
 ('Hungary',),
 ('Italy',),
 ('Japan',),
 ('Latvia',),
 ('Lithuania',),
 ('Moldova',),
 ('Monaco',),
 ('Poland',),
 ('Portugal',),
 ('Romania',),
 ('Russia',),
 ('Serbia',),
 ('Slovenia',),
 ('Ukraine',),
 ('Saint Pierre and Miquelon',)]

### Which countries have the highest population/area ratio and how doest it compare to countries that has lowest area but has highest population?

In [41]:
%%sql
SELECT name 
  FROM facts 
    WHERE population/area = (SELECT MAX(population/area)
                               FROM facts);

 * sqlite:///factbook.db
Done.

[('Macau',)]

Compare to the lowest than average area with highest population, MACAU still has decent AREA that is higher than the average but still having good number of population. Therefore, MACAU has the highest populaton/area